# Task 4.9 Intro to Data Visualization with Python PART 1

# Table of contents
#### 1. Importing Libraries
#### 2. Importing Data
#### 3. Data Wrangling
#### 4. Data Consistency Checks
#### 5. Merging Data Sets
#### 6. Exporting Data

# 01. Importing Libraries

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

# 02. Importing Data

In [2]:
# Turn project folder path into a string

path = r'C:\Users\osoty\Desktop\CareerFoundry Data Analytics\Data Immersion\Achievement 4\02-23 Instacart Basket Analysis'

In [3]:
# Import the latest ords_prods_merge dataframe 

df_ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data','Prepared Data','orders_products_merged_update_2_clean.pkl'))

In [4]:
# Check the max of the 'prices' column to confirm the most updated ords_prods_merge dataframe was imported

df_ords_prods_merge['prices'].max()

25.0

In [5]:
# Check the output of the imported dataframe

df_ords_prods_merge.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_price,spending_flag,order_frequency,frequency_flag
0,2539329,1,1,2,8,NaN,True,196,1,0,...,Mid-range product,Regularly busy,Regularly busy days,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2398795,1,2,3,7,15.0,False,196,1,1,...,Mid-range product,Regularly busy,Slowest days,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,473747,1,3,3,12,21.0,False,196,1,1,...,Mid-range product,Regularly busy,Slowest days,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2254736,1,4,4,7,29.0,False,196,1,1,...,Mid-range product,Least busy,Slowest days,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,431534,1,5,4,15,28.0,False,196,1,1,...,Mid-range product,Least busy,Slowest days,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [6]:
# Check the size of df_ords_prods_merge

df_ords_prods_merge.shape

(32404859, 25)

In [7]:
# Import customers.csv

df_customers = pd.read_csv(os.path.join(path, '02 Data','Original Data', 'customers.csv'),index_col = False)

In [8]:
# Check the output of the imported dataframe

df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [9]:
# Check the size of the imported dataframe

df_customers.shape

(206209, 10)

# 03 Data Wrangling

### 4. Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that donâ€™t add anything to your analysis.

### Dropping Columns

In [10]:
# Drop columns that are not necessary for the analysis

df_customers = df_customers.drop(columns = ['First Name','Surnam'])

#### The 'First Name' and 'Surnam' columns are not relevant for the analysis and can be dropped.

In [11]:
# Check the dataframe to make sure the columns have been dropped

df_customers.head()

,user_id,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

### Checking Data Type

In [12]:
# Check the datatypes

df_customers.dtypes

user_id          int64
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [13]:
# Change the datatype of the 'user_id' column from integer to string

df_customers['user_id'] = df_customers['user_id'].astype ('str')

In [14]:
# Check if the change of datatype was successful

df_customers['user_id'].dtype

dtype('O')

### Renaming Coumns

In [15]:
# Rename columns with illogical names

df_customers.rename(columns = {'Gender' : 'gender', 'STATE' : 'state','Age' : 'age', 'n_dependants' : 'number_dependants', 'fam_status' : 'family_status'}, inplace = True)

In [16]:
# Check if the renaming was successful

df_customers.head()

,user_id,gender,state,age,date_joined,number_dependants,family_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

# 04. Data Consistency Checks

### 5. Complete the fundamental data quality and consistency checks youâ€™ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

### Counting Missing Values

In [17]:
# Check for null values 

df_customers.isnull().sum()

user_id              0
gender               0
state                0
age                  0
date_joined          0
number_dependants    0
family_status        0
income               0
dtype: int64

#### There are no missing values in the dataframe.

In [18]:
# Descriptive statistics

df_customers.describe()

                 age  number_dependants         income
count  206209.000000      206209.000000  206209.000000
mean       49.501646           1.499823   94632.852548
std        18.480962           1.118433   42473.786988
min        18.000000           0.000000   25903.000000
25%        33.000000           0.000000   59874.000000
50%        49.000000           1.000000   93547.000000
75%        66.000000           3.000000  124244.000000
max        81.000000           3.000000  593901.000000

#### Everything looks consistent.

In [19]:
# Find duplicates

df_dups = df_customers[df_customers.duplicated()]

In [20]:
df_dups

Empty DataFrame
Columns: [user_id, gender, state, age, date_joined, number_dependants, family_status, income]
Index: []

#### There are no duplicates.

In [21]:
# Check for mixed data type in the customers dataframe

for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

#### There are no mixed data types for the customers dataframe.

# 05. Merging Data Sets

### 6. Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

In [22]:
# Check if the 'user_id' column of both dataframes, which will be used to combine the dataframes, is the same data type

df_customers['user_id'].dtype

dtype('O')

In [23]:
# Check the data type of the 'user_id' column of the df_ords_prods_merge dataframe

df_ords_prods_merge['user_id'].dtype

dtype('int64')

In [24]:
# Change the data type of the 'user_id' column in the df_ords_prods_merge dataframe

df_ords_prods_merge['user_id'] = df_ords_prods_merge['user_id'].astype ('str')

In [25]:
# Check the change

df_ords_prods_merge['user_id'].dtype

dtype('O')

In [26]:
# Merge the dataframes using the 'user_id' column

df_ords_prods_custm = pd.merge(df_ords_prods_merge, df_customers, on = 'user_id', how = 'outer')

In [27]:
# Check the output of the new dataframe

df_ords_prods_custm.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,...,spending_flag,order_frequency,frequency_flag,gender,state,age,date_joined,number_dependants,family_status,income
0,2539329,1,1,2,8,NaN,True,196,1,0,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15.0,False,196,1,1,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21.0,False,196,1,1,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29.0,False,196,1,1,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28.0,False,196,1,1,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423

In [28]:
# Check the size of the new dataframe

df_ords_prods_custm.shape

(32404859, 32)

# 06. Exporting Data

### 8. Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [29]:
# Check the memory usage for the dataframe

df_ords_prods_custm.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 32 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 object
 2   order_number            int64
 3   order_day_of_week       int64
 4   order_hour_of_day       int64
 5   days_since_prior_order  float64
 6   new_customer            bool
 7   product_id              int64
 8   add_to_cart_order       int64
 9   reordered               int64
 10  product_name            object
 11  aisle_id                int64
 12  department_id           int64
 13  prices                  float64
 14  _merge                  category
 15  price_range_loc         object
 16  busiest_day             object
 17  busiest_days            object
 18  busiest_period_of_day   object
 19  max_order               int64
 20  loyalty_flag            object
 21  average_price           float64
 22  spending_flag           object
 23  order_frequency         float64
 24  frequency_flag          object
 25  gender                  object
 26  state                   object
 27  age                     int64
 28  date_joined             object
 29  number_dependants       int64
 30  family_status           object
 31  income                  int64
dtypes: bool(1), category(1), float64(4), int64(13), object(13)
memory usage: 7.5+ GB

In [30]:
# Change the data type on some columns to save memory

df_ords_prods_custm['order_id']=df_ords_prods_custm['order_id'].astype('int32')
df_ords_prods_custm['order_number']=df_ords_prods_custm['order_number'].astype('int8')
df_ords_prods_custm['order_day_of_week']=df_ords_prods_custm['order_day_of_week'].astype('int8')
df_ords_prods_custm['order_hour_of_day']=df_ords_prods_custm['order_hour_of_day'].astype('int8')
df_ords_prods_custm['days_since_prior_order']=df_ords_prods_custm['days_since_prior_order'].astype('float16')
df_ords_prods_custm['max_order'] = df_ords_prods_custm['max_order'].astype('int8')
df_ords_prods_custm['number_dependants'] = df_ords_prods_custm['number_dependants'].astype('int8')
df_ords_prods_custm['product_id'] =df_ords_prods_custm['product_id'].astype('int32')
df_ords_prods_custm['reordered']=df_ords_prods_custm['reordered'].astype('int8')
df_ords_prods_custm['add_to_cart_order']=df_ords_prods_custm['add_to_cart_order'].astype('int32')
df_ords_prods_custm['aisle_id']=df_ords_prods_custm['aisle_id'].astype('int32')
df_ords_prods_custm['department_id']=df_ords_prods_custm['department_id'].astype('int32')

In [31]:
# Check the memory usage again

df_ords_prods_custm.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 32 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 object
 2   order_number            int8
 3   order_day_of_week       int8
 4   order_hour_of_day       int8
 5   days_since_prior_order  float16
 6   new_customer            bool
 7   product_id              int32
 8   add_to_cart_order       int32
 9   reordered               int8
 10  product_name            object
 11  aisle_id                int32
 12  department_id           int32
 13  prices                  float64
 14  _merge                  category
 15  price_range_loc         object
 16  busiest_day             object
 17  busiest_days            object
 18  busiest_period_of_day   object
 19  max_order               int8
 20  loyalty_flag            object
 21  average_price           float64
 22  spending_flag           object
 23  order_frequency         float64
 24  frequency_flag          object
 25  gender                  object
 26  state                   object
 27  age                     int64
 28  date_joined             object
 29  number_dependants       int8
 30  family_status           object
 31  income                  int64
dtypes: bool(1), category(1), float16(1), float64(3), int32(5), int64(2), int8(6), object(13)
memory usage: 5.5+ GB

In [32]:
# Check the output before exporting the dataframe

df_ords_prods_custm.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,...,spending_flag,order_frequency,frequency_flag,gender,state,age,date_joined,number_dependants,family_status,income
0,2539329,1,1,2,8,NaN,True,196,1,0,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15.0,False,196,1,1,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21.0,False,196,1,1,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29.0,False,196,1,1,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28.0,False,196,1,1,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423

In [33]:
# Export the new dataframe as a pickle file

df_ords_prods_custm.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_customers_merge.pkl'))